// C#은 굉장히 고지식한 객체지향 언어이다.

/*
직업
레벨
스킬
체력
마나
퀘스트
몬스터
무기
*/

// 객체지향은 저 중에서 적절히 묶어서 클래스화라는 것을 시킨다.
// 그걸 표현하는 것이 클래스
/*
class(클래스를 선언하기 위한 키워드) 이름
{ <- 클래스의 내용의 시작
}
*/

// 객체지향->
// 내가 표현하고 싶은걸 클래스로 만들어서
// 그 클래스로 객체를 만드는 프로그래밍이다.
// 객체를 기반으로 모든 걸 해결하기 때문에
// 객체를 지향(향한다)할 수 밖에 없는 프로그래밍

// 구현과 개념이 분리되지 않는다.

// 내가 생각한 개념이 
// 내 프로그램에서 사용되어지기 위한
// 설계도를 의미하게 된다.
// 코딩에서는 무조건 설계도가 먼저다.
// 무조건 클래스 먼저 그다음이 객체.

class Inventory
{

}
class Player
{

}
class Pet
{
    // 내부의 내용은 중요하지 않다.
}
class Monster
{
    // 내부의 내용은 중요하지 않다.
}
